boltonja/armduino/hardware/arduino/m3u/boards.txt

silabs_acb_x_dbg.name=Silicon Laboratories SiM3U1XX ACB
silabs_acb_x_dbg.upload.tool=avrdude
silabs_acb_x_dbg.upload.protocol=wiring
silabs_acb_x_dbg.upload.maximum_size=262144
silabs_acb_x_dbg.upload.use_1200bps_touch=true
silabs_acb_x_dbg.upload.wait_for_upload_port=false
silabs_acb_x_dbg.upload.native_usb=false
silabs_acb_x_dbg.build.mcu=cortex-m3
silabs_acb_x_dbg.build.f_cpu=80000000L
silabs_acb_x_dbg.build.core=arduino
silabs_acb_x_dbg.build.extra_flags=-D__M3U1XX__ -mthumb -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
silabs_acb_x_dbg.build.ldscript=linker_scripts/gcc/flash.ld
silabs_acb_x_dbg.build.variant=silabs_acb_x
silabs_acb_x_dbg.build.variant_system_lib=libsam_sam3x8e_gcc_rel.a
silabs_acb_x_dbg.build.vid=0x2341
silabs_acb_x_dbg.build.pid=0x003e

